[
  {
    "topic": "Current Role - Amazon",
    "content": "Julia Baucher is currently a Senior BI Product Manager Tech for Transportation Services at Amazon Luxembourg (2021-2025). She defines product vision, strategy, risks, and success metrics for Logistic Optimizations webapps and ML models. She leads cross-functional development of Labor Planning & Assignment web apps, forecasting ML models, and BI dashboards including roadmap planning, prioritization, user journeys, BRD, tech & UX design, sprints, tests, go-to-market, and KPI tracking. She builds partnerships with investment strategy, remote stakeholders management, status reports, and SLA. She has hired and coached FTEs & interns, delivered SCRUM training ranked 4.8/5.0, and organized tech events."
  },
  {
    "topic": "Amadeus Experience - Product Manager",
    "content": "At Amadeus France (2013-2020), Julia worked as Product Manager & Consultant for Revenue Accounting & Finance. She defined product strategy, identified new opportunities, aligned priorities with airline's consortium, translated business needs into product features, and executed programs for Airline's Revenue Accounting. She ran onsite consulting sessions to optimize system usage, business processes, and overall user experience, monitoring SLA KPI for Malaysia Airlines, Vistara, Icelandair, Luxair, Wideroe, and South Africa. She conducted multiple pre-sales projects including RFP&RFI responses, workshops, live demos, and value propositions."
  },
  {
    "topic": "Amadeus Experience - eCommerce",
    "content": "Earlier at Amadeus France (2006-2013), Julia was Responsable de Produit en e-Commerce & Shopping. She led development of B2C airline's web and mobile applications with millions of monthly users. She defined vision, strategy, value proposition, and managed programs execution for Travel Search Engines. She redesigned internet banking platform translating strategic objectives into a feature-based roadmap. She built U/X portfolio for airlines website customization and conducted market research for business cases."
  },
  {
    "topic": "Research and Early Career",
    "content": "Julia worked as a Research Engineer at University of Cambridge, UK (2006) where she initiated a research stream in injection moulding between Ecole des Mines and Cambridge. Earlier, she worked as a Data analyst at McKinsey & Company, Russia (2001) managing marketing research and data analysis."
  },
  {
    "topic": "Education",
    "content": "Julia holds a PhD in Computational Mechanics from Ecole des Mines de Paris, France (2006) and an Engineer's Diploma in Mechanics from Bauman Moscow State Technical University, Russia (2002)."
  },
  {
    "topic": "Awards and Recognition",
    "content": "Julia has received several awards: First prize in Startup Weekend for eCommerce platform at Google for Startups, Monaco (2017); Award for Excellence in Engineering Computations from Emerald Publishing, UK (2008); Winner of international scholarship for PhD studies from EGIDE, France (2002); Award at youth Scientific Contest 'Step-into-the-future' from National Academy of Science, Russia (1996)."
  },
  {
    "topic": "Technical Skills",
    "content": "Julia's IT skills include Python, SQL, Tableau, Quicksight, ETL, C/C++, Java, HTML, API XML, JSON. She works with Windows, Linux, MAC operating systems. She uses Microsoft Office, SharePoint, Camtasia, Eclipse, IntelliJ, Postman, WordPress, Jira. She has experience with SAFe, Agile, Waterfall, CMMI methodologies, UX design, PCI DSS, and GDPR compliance."
  },
  {
    "topic": "Soft Skills and Languages",
    "content": "Julia has strong analytical and self-learning capabilities, problem-solving skills, data-driven decision-making abilities, clear and concise communication, stakeholder management skills, and empathy. She speaks native Russian, is fluent in French and English, and has communication skills in Spanish."
  },
  {
    "topic": "Contact Information",
    "content": "Julia Baucher can be reached at +33 (0)6 62 72 83 22, email juliabaucher.work@gmail.com, LinkedIn linkedin.com/in/juliabaucher, and her website juliabaucher.github.io. She has French citizenship."
  },
  {
    "topic": "Product Management Expertise",
    "content": "Julia has extensive product management experience spanning over 15 years. She specializes in B2B and B2C product development, with particular expertise in logistics optimization, airline revenue systems, and e-commerce platforms. She has managed products with millions of users and has experience with both startup environments and large corporations like Amazon and Amadeus. Her approach combines technical depth with business strategy, focusing on data-driven decision making and user-centric design."
  },
  {
    "topic": "Machine Learning and AI Experience",
    "content": "At Amazon, Julia works extensively with ML models for logistics optimization and forecasting. She has experience with BI dashboards using tools like Tableau and Quicksight. Her background includes developing and managing ML-powered applications for labor planning and assignment. She combines her technical background in computational mechanics with modern AI/ML applications in business contexts."
  },
  {
    "topic": "Leadership and Team Management",
    "content": "Julia has proven leadership experience including hiring and coaching both full-time employees and interns. She has delivered SCRUM training with excellent ratings (4.8/5.0) and organized technical events. She excels at cross-functional team leadership, managing remote stakeholders, and building partnerships. Her leadership style emphasizes collaboration, clear communication, and results-oriented approaches."
  },
  {
    "topic": "International Experience",
    "content": "Julia has worked across multiple countries and cultures. She has experience in Russia (McKinsey), UK (Cambridge University), France (Amadeus, Ecole des Mines), and Luxembourg (Amazon). She has conducted onsite consulting for airlines across different regions including Malaysia Airlines, Vistara (India), Icelandair, Luxair, Widerøe (Norway), and South African airlines. This international experience gives her a global perspective on business and technology."
  },
  {
    "topic": "Volunteering and Personal Interests",
    "content": "Julia participates in AFM-Telethons as part of her volunteering activities. She has a strong interest in technology innovation, as evidenced by her participation and first prize win in Startup Weekend for an eCommerce platform. She maintains an active interest in both technical and business aspects of product development."
  }
]